app/Http/Controllers/BackPanel/AppointmentController.php

select * from `customers`
select * from `users` where `users`.`id` in (6, 7)
select * from `employees`
select * from `users` where `users`.`id` in (4, 5)
select * from `service_types`
---
    public function create()
    {
        {
            /* @var Customer[]|Collection $customers */
            $customers = Customer::query()
                ->with(['user'])
                ->get();

            $customers_appointment = [];
            foreach ($customers as $customer) {
                $customers_appointment[$customer->id] = $customer->user->name;
            }
            /* @var Employee[]|Collection $employees */
            $employees = Employee::query()
                ->with(['user'])
                ->get();

            $employees_appointment = [];
            foreach ($employees as $employee) {
                $employees_appointment[$employee->id] = $employee->user->name;
            }
            /* @var ServiceType[]|Collection $service_types */
            $service_types = ServiceType::query()
                ->get();